perf_logs/original_chat_load_test.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: chat_load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 7 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 34 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 44 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 47 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......: 57      5.343623/s
    checks_succeeded...: 100.00% 57 out of 57
    checks_failed......: 0.00%   0 out of 57

    ✓ status was 200

    HTTP
    http_req_duration..............: avg=792.03ms min=310.1ms med=680.05ms max=2.04s p(90)=1.11s p(95)=1.29s
      { expected_response:true }...: avg=792.03ms min=310.1ms med=680.05ms max=2.04s p(90)=1.11s p(95)=1.29s
    http_req_failed................: 0.00% 0 out of 57
    http_reqs......................: 57    5.343623/s

    EXECUTION
    iteration_duration.............: avg=1.79s    min=1.31s   med=1.68s    max=3.04s p(90)=2.11s p(95)=2.3s 
    iterations.....................: 57    5.343623/s
    vus............................: 10    min=10      max=10
    vus_max........................: 10    min=10      max=10

    NETWORK
    data_received..................: 23 kB 2.2 kB/s
    data_sent......................: 12 kB 1.1 kB/s



running (10.7s), 00/10 VUs, 57 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s